; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 961535 2 2 2 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	infrared1 - mode
	GroundStation3 - direction
	Star1 - direction
	GroundStation0 - direction
	Star2 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Planet4 infrared1)
	(have_image Planet5 infrared1)
	(have_image Star6 infrared1)
	(have_image Planet7 infrared1)
	(have_image Planet8 infrared1)
	(have_image Planet9 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (turn_to satellite0 groundstation0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 7
4. (turn_to satellite1 planet9 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet9)
   goals met: 0 of 7
5. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 7
6. (turn_to satellite0 planet9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet9)
   goals met: 0 of 7
7. (take_image satellite0 planet9 instrument1 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 1 of 7
8. (turn_to satellite0 star2 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star2)
   goals met: 2 of 7
9. (turn_to satellite0 planet8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet8)
   goals met: 1 of 7
10. (take_image satellite0 planet8 instrument1 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 2 of 7
11. (turn_to satellite0 star2 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star2)
   goals met: 3 of 7
12. (turn_to satellite0 planet7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet7)
   goals met: 2 of 7
13. (take_image satellite0 planet7 instrument1 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 3 of 7
14. (turn_to satellite0 star2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star2)
   goals met: 4 of 7
15. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   goals met: 3 of 7
16. (take_image satellite0 planet5 instrument1 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 4 of 7
17. (turn_to satellite0 star2 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star2)
   goals met: 5 of 7
18. (turn_to satellite0 planet4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet4)
   goals met: 4 of 7
19. (take_image satellite0 planet4 instrument1 infrared1)
   added: (have_image planet4 infrared1)
   goals met: 5 of 7
20. (turn_to satellite0 star2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star2)
   goals met: 6 of 7
21. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   goals met: 5 of 7
22. (take_image satellite0 star6 instrument1 infrared1)
   added: (have_image star6 infrared1)
   goals met: 6 of 7
23. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   goals met: 7 of 7
